In [1]:
import pandas as pd
import numpy as np

In [2]:
#Task 1
#saving project dataframe into csv

project = pd.DataFrame({"ID":['A001','A002','A003','A004','A005','A002','A005','A003','A001','A003','A001','A004','A004','A005'],"Project":['Project 1','Project 2','Project 3','Project 4','Project 5','Project 6','Project 7','Project 8','Project 9','Project 10','Project 11','Project 12','Project 13','Project 14'],"Cost":[1002000,2000000,4500000,5500000,'',680000,400000,350000,'',300000,2000000,1000000,3000000,200000],"Status":['Finished','Ongoing','Finished','Ongoing','Finished','Failed','Finished','Failed','Ongoing','Finished','Failed','Ongoing','Finished','Finished']})
base_path = '.'
file_name = 'project.csv'

# Using python os module to join directory path and relative file path
import os
out = os.path.join(base_path,file_name)
print("saving array {} in file {}".format(project, out))

# fmt can be specified as integer, float, string, etc
np.savetxt(out,project, delimiter=',',fmt = '%s')

saving array       ID     Project     Cost    Status
0   A001   Project 1  1002000  Finished
1   A002   Project 2  2000000   Ongoing
2   A003   Project 3  4500000  Finished
3   A004   Project 4  5500000   Ongoing
4   A005   Project 5           Finished
5   A002   Project 6   680000    Failed
6   A005   Project 7   400000  Finished
7   A003   Project 8   350000    Failed
8   A001   Project 9            Ongoing
9   A003  Project 10   300000  Finished
10  A001  Project 11  2000000    Failed
11  A004  Project 12  1000000   Ongoing
12  A004  Project 13  3000000  Finished
13  A005  Project 14   200000  Finished in file .\project.csv

In [3]:
#saving employee dataframe into csv

employee = pd.DataFrame({"ID":['A001','A002','A003','A004','A005'],"Name":['John Alter','Alice Luxumberg','Tom Sabestine','Nina Adgra','Amy Johny'],"Gender":['M','F','M','F','F'],"City":['Paris','London','Berlin','Newyork','Madrid'],"Age":[25,27,29,31,30]})
base_path = '.'
file_name = 'employee.csv'

# Using python os module to join directory path and relative file path
import os
out = os.path.join(base_path,file_name)
print("saving array {} in file {}".format(employee, out))

# fmt can be specified as integer, float, string, etc
np.savetxt(out,employee, delimiter=',',fmt = '%s')

saving array      ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30 in file .\employee.csv

In [4]:
#saving seniority dataframe into csv

seniority = pd.DataFrame({"ID":['A001','A002','A003','A004','A005'], "Designation Level":[2,2,3,2,3]})
base_path = '.'
file_name = 'seniority_np.csv'
# Using python os module to join directory path and relative file path
import os
out = os.path.join(base_path,file_name)
print("saving array {} in file {}".format(seniority, out))

# fmt can be specified as integer, float, string, etc
np.savetxt(out,seniority, delimiter=',',fmt = '%s')

saving array      ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3 in file .\seniority_np.csv

In [5]:
#Task 2 

# Convert the Cost column to numeric, replacing errors with NaN
project['Cost'] = pd.to_numeric(project['Cost'])

# Replace missing values with running average from project dataframe
sum_cost = 0
count = 0

for i in range(len(project)):
    if pd.isna(project.loc[i, 'Cost']):
        if count > 0:
            project.loc[i, 'Cost'] = sum_cost / count
    else:
        sum_cost += project.loc[i, 'Cost']
        count += 1

In [6]:
#Task 3

# Ensure the 'Name' column is of type str
employee['Name'] = employee['Name'].astype(str)

# Splitting the Name column into First Name and Last Name
employee[['FirstName','LastName']] = employee['Name'].loc[employee['Name'].str.split().str.len() == 2].str.split(expand = True)

# Dropping the original Name column
employee = employee.drop(columns = ['Name'])

#Updated dataframe
employee

     ID Gender     City  Age FirstName   LastName
0  A001      M    Paris   25      John      Alter
1  A002      F   London   27     Alice  Luxumberg
2  A003      M   Berlin   29       Tom  Sabestine
3  A004      F  Newyork   31      Nina      Adgra
4  A005      F   Madrid   30       Amy      Johny

In [7]:
#Task 4 
#Joining all three dataframes in one single dataframe

Final = project.merge(employee, on = 'ID').merge(seniority, on = 'ID')

print(Final)

      ID     Project          Cost    Status Gender     City  Age FirstName  \
0   A001   Project 1  1.002000e+06  Finished      M    Paris   25      John
1   A002   Project 2  2.000000e+06   Ongoing      F   London   27     Alice
2   A003   Project 3  4.500000e+06  Finished      M   Berlin   29       Tom
3   A004   Project 4  5.500000e+06   Ongoing      F  Newyork   31      Nina
4   A005   Project 5  3.250500e+06  Finished      F   Madrid   30       Amy
5   A002   Project 6  6.800000e+05    Failed      F   London   27     Alice
6   A005   Project 7  4.000000e+05  Finished      F   Madrid   30       Amy
7   A003   Project 8  3.500000e+05    Failed      M   Berlin   29       Tom
8   A001   Project 9  2.061714e+06   Ongoing      M    Paris   25      John
9   A003  Project 10  3.000000e+05  Finished      M   Berlin   29       Tom
10  A001  Project 11  2.000000e+06    Failed      M    Paris   25      John
11  A004  Project 12  1.000000e+06   Ongoing      F  Newyork   31      Nina
12  A004  Project 13  3.000000e+06  Finished      F  Newyork   31      Nina
13  A005  Project 14  2.000000e+05  Finished      F   Madrid   30       Amy

     LastName  Designation Level
0       Alter                  2
1   Luxumberg                  2
2   Sabestine                  3
3       Adgra                  2
4       Johny                  3
5   Luxumberg                  2
6       Johny                  3
7   Sabestine                  3
8       Alter                  2
9   Sabestine                  3
10      Alter                  2
11      Adgra                  2
12      Adgra                  2
13      Johny                  3

In [8]:
#Task 5 
#Giving 5% bonus cost only to employees who have finished the projects

Final['Bonus'] = Final.apply(lambda row: (row['Cost']*0.05 + row.Cost) if row.Status =='Finished' else 0, axis=1)
print(Final)

      ID     Project          Cost    Status Gender     City  Age FirstName  \
0   A001   Project 1  1.002000e+06  Finished      M    Paris   25      John
1   A002   Project 2  2.000000e+06   Ongoing      F   London   27     Alice
2   A003   Project 3  4.500000e+06  Finished      M   Berlin   29       Tom
3   A004   Project 4  5.500000e+06   Ongoing      F  Newyork   31      Nina
4   A005   Project 5  3.250500e+06  Finished      F   Madrid   30       Amy
5   A002   Project 6  6.800000e+05    Failed      F   London   27     Alice
6   A005   Project 7  4.000000e+05  Finished      F   Madrid   30       Amy
7   A003   Project 8  3.500000e+05    Failed      M   Berlin   29       Tom
8   A001   Project 9  2.061714e+06   Ongoing      M    Paris   25      John
9   A003  Project 10  3.000000e+05  Finished      M   Berlin   29       Tom
10  A001  Project 11  2.000000e+06    Failed      M    Paris   25      John
11  A004  Project 12  1.000000e+06   Ongoing      F  Newyork   31      Nina
12  A004  Project 13  3.000000e+06  Finished      F  Newyork   31      Nina
13  A005  Project 14  2.000000e+05  Finished      F   Madrid   30       Amy

     LastName  Designation Level      Bonus
0       Alter                  2  1052100.0
1   Luxumberg                  2        0.0
2   Sabestine                  3  4725000.0
3       Adgra                  2        0.0
4       Johny                  3  3413025.0
5   Luxumberg                  2        0.0
6       Johny                  3   420000.0
7   Sabestine                  3        0.0
8       Alter                  2        0.0
9   Sabestine                  3   315000.0
10      Alter                  2        0.0
11      Adgra                  2        0.0
12      Adgra                  2  3150000.0
13      Johny                  3   210000.0

In [9]:
#Task 6 
#Demote the designation level by 1, whose projects have status “fail”. 

Final['Designation Level'] = Final.apply(lambda row: (row['Designation Level'] - 1) if row['Status'] == 'Failed' else row['Designation Level'], axis=1)

#Delete the employees record whose designation level is above 4.
#Identify the indexes to drop
index_drop = Final[Final['Designation Level'] > 4].index

# Drop those indexes
Final = Final.drop(index_drop)

print(Final)

      ID     Project          Cost    Status Gender     City  Age FirstName  \
0   A001   Project 1  1.002000e+06  Finished      M    Paris   25      John
1   A002   Project 2  2.000000e+06   Ongoing      F   London   27     Alice
2   A003   Project 3  4.500000e+06  Finished      M   Berlin   29       Tom
3   A004   Project 4  5.500000e+06   Ongoing      F  Newyork   31      Nina
4   A005   Project 5  3.250500e+06  Finished      F   Madrid   30       Amy
5   A002   Project 6  6.800000e+05    Failed      F   London   27     Alice
6   A005   Project 7  4.000000e+05  Finished      F   Madrid   30       Amy
7   A003   Project 8  3.500000e+05    Failed      M   Berlin   29       Tom
8   A001   Project 9  2.061714e+06   Ongoing      M    Paris   25      John
9   A003  Project 10  3.000000e+05  Finished      M   Berlin   29       Tom
10  A001  Project 11  2.000000e+06    Failed      M    Paris   25      John
11  A004  Project 12  1.000000e+06   Ongoing      F  Newyork   31      Nina
12  A004  Project 13  3.000000e+06  Finished      F  Newyork   31      Nina
13  A005  Project 14  2.000000e+05  Finished      F   Madrid   30       Amy

     LastName  Designation Level      Bonus
0       Alter                  2  1052100.0
1   Luxumberg                  2        0.0
2   Sabestine                  3  4725000.0
3       Adgra                  2        0.0
4       Johny                  3  3413025.0
5   Luxumberg                  1        0.0
6       Johny                  3   420000.0
7   Sabestine                  2        0.0
8       Alter                  2        0.0
9   Sabestine                  3   315000.0
10      Alter                  1        0.0
11      Adgra                  2        0.0
12      Adgra                  2  3150000.0
13      Johny                  3   210000.0

In [10]:
#Task 7 
#Add “Mr.” and “Mrs.” to the first name column 
Final['FirstName'] = Final.apply(lambda row: ('Mr. ' + row['FirstName']) if row['Gender'] == 'M' else ('Mrs. ' + row['FirstName']), axis = 1)

# Drop the Gender column
Final = Final.drop(columns = ['Gender'])
print(Final)

      ID     Project          Cost    Status     City  Age   FirstName  \
0   A001   Project 1  1.002000e+06  Finished    Paris   25    Mr. John
1   A002   Project 2  2.000000e+06   Ongoing   London   27  Mrs. Alice
2   A003   Project 3  4.500000e+06  Finished   Berlin   29     Mr. Tom
3   A004   Project 4  5.500000e+06   Ongoing  Newyork   31   Mrs. Nina
4   A005   Project 5  3.250500e+06  Finished   Madrid   30    Mrs. Amy
5   A002   Project 6  6.800000e+05    Failed   London   27  Mrs. Alice
6   A005   Project 7  4.000000e+05  Finished   Madrid   30    Mrs. Amy
7   A003   Project 8  3.500000e+05    Failed   Berlin   29     Mr. Tom
8   A001   Project 9  2.061714e+06   Ongoing    Paris   25    Mr. John
9   A003  Project 10  3.000000e+05  Finished   Berlin   29     Mr. Tom
10  A001  Project 11  2.000000e+06    Failed    Paris   25    Mr. John
11  A004  Project 12  1.000000e+06   Ongoing  Newyork   31   Mrs. Nina
12  A004  Project 13  3.000000e+06  Finished  Newyork   31   Mrs. Nina
13  A005  Project 14  2.000000e+05  Finished   Madrid   30    Mrs. Amy

     LastName  Designation Level      Bonus
0       Alter                  2  1052100.0
1   Luxumberg                  2        0.0
2   Sabestine                  3  4725000.0
3       Adgra                  2        0.0
4       Johny                  3  3413025.0
5   Luxumberg                  1        0.0
6       Johny                  3   420000.0
7   Sabestine                  2        0.0
8       Alter                  2        0.0
9   Sabestine                  3   315000.0
10      Alter                  1        0.0
11      Adgra                  2        0.0
12      Adgra                  2  3150000.0
13      Johny                  3   210000.0

In [11]:
#Task 8 
#Promote designation level by 1 for the employees whose age is more than 29 years using IF condition.
Final['Designation Level'] = Final.apply (lambda row: (row['Designation Level'] + 1) if row['Age'] > 29 else row['Designation Level'],axis = 1)

print(Final)

      ID     Project          Cost    Status     City  Age   FirstName  \
0   A001   Project 1  1.002000e+06  Finished    Paris   25    Mr. John
1   A002   Project 2  2.000000e+06   Ongoing   London   27  Mrs. Alice
2   A003   Project 3  4.500000e+06  Finished   Berlin   29     Mr. Tom
3   A004   Project 4  5.500000e+06   Ongoing  Newyork   31   Mrs. Nina
4   A005   Project 5  3.250500e+06  Finished   Madrid   30    Mrs. Amy
5   A002   Project 6  6.800000e+05    Failed   London   27  Mrs. Alice
6   A005   Project 7  4.000000e+05  Finished   Madrid   30    Mrs. Amy
7   A003   Project 8  3.500000e+05    Failed   Berlin   29     Mr. Tom
8   A001   Project 9  2.061714e+06   Ongoing    Paris   25    Mr. John
9   A003  Project 10  3.000000e+05  Finished   Berlin   29     Mr. Tom
10  A001  Project 11  2.000000e+06    Failed    Paris   25    Mr. John
11  A004  Project 12  1.000000e+06   Ongoing  Newyork   31   Mrs. Nina
12  A004  Project 13  3.000000e+06  Finished  Newyork   31   Mrs. Nina
13  A005  Project 14  2.000000e+05  Finished   Madrid   30    Mrs. Amy

     LastName  Designation Level      Bonus
0       Alter                  2  1052100.0
1   Luxumberg                  2        0.0
2   Sabestine                  3  4725000.0
3       Adgra                  3        0.0
4       Johny                  4  3413025.0
5   Luxumberg                  1        0.0
6       Johny                  4   420000.0
7   Sabestine                  2        0.0
8       Alter                  2        0.0
9   Sabestine                  3   315000.0
10      Alter                  1        0.0
11      Adgra                  3        0.0
12      Adgra                  3  3150000.0
13      Johny                  4   210000.0

In [12]:
#Task 9
#Add the cost of all projects for each Employee and save it in new dataframe “TotalProjCost” with three columns ID, First Name, and Total cos

TotalProjCost = Final.groupby(['ID','FirstName'])['Cost'].sum()

print(TotalProjCost)

ID    FirstName
A001  Mr. John      5.063714e+06
A002  Mrs. Alice    2.680000e+06
A003  Mr. Tom       5.150000e+06
A004  Mrs. Nina     9.500000e+06
A005  Mrs. Amy      3.850500e+06
Name: Cost, dtype: float64

In [13]:
#Task 10 
#Print all the employee details whose city name contains the letter “o” in it.

employee[employee['City'].str.contains('o')]

     ID Gender     City  Age FirstName   LastName
1  A002      F   London   27     Alice  Luxumberg
3  A004      F  Newyork   31      Nina      Adgra